app/controllers/jenkins_factory_controller.rb

INSERT INTO "jenkins_factories" ("created_at", "password", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Thu, 11 Jul 2013 21:07:37 UTC +00:00], ["password", "Bear052092"], ["updated_at", Thu, 11 Jul 2013 21:07:37 UTC +00:00], ["username", "rafeldb"]]
---
  def create
  	JenkinsFactory.factories[params["id"]] = JenkinsFactory.new(create_params)
  	@JenkinsFactory = JenkinsFactory.factories[params["id"]]
  	@JenkinsFactory.save